In [3]:
import pandas as pd

In [4]:
print(pd.__version__)

1.5.3

In [5]:
data={
    "names":['a','b','c'],
    "ages":[25,28,21]
}
df=pd.DataFrame(data)
df

  names  ages
0     a    25
1     b    28
2     c    21

In [6]:
df.tail(1)

  names  ages
2     c    21

In [7]:
df.describe

<bound method NDFrame.describe of   names  ages
0     a    25
1     b    28
2     c    21>

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   ages    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [9]:
df.columns=["emp_name",'age']
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [10]:
df2=df.rename(columns={"emp_name":"emp_first_name","age":"emp_age"})

In [11]:
df

  emp_name  age
0        a   25
1        b   28
2        c   21

In [12]:
dept = ["sales","marketing","IT"]

In [18]:
# derive a new column
df2=df.assign(Company=dept)

In [17]:
df2.dtypes

emp_name    object
age          int64
Company     object
dtype: object

In [20]:
df3=df2.convert_dtypes()

In [21]:
df3.dtypes

emp_name    string
age          Int64
Company     string
dtype: object

In [22]:
df4=df2.astype({"age":float})

In [23]:
df4.dtypes

emp_name     object
age         float64
Company      object
dtype: object

In [24]:
len(df4.index)#rows

3

In [26]:
df4.shape#col

(3, 3)

In [27]:
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }

In [30]:
#change indexing 
index_label = ['r1','r2','r3','r4','r5']

In [31]:
df = pd.DataFrame(technologies)

In [32]:
df

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1200
3   Python  22000   40days      2500
4   pandas  24000   60days      2000

In [33]:
# dataframe with difft index
df = pd.DataFrame(technologies,index=index_label)

In [34]:
df

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [36]:
# filter
# df.loc[start:stop:step,start:stop:step]
#         select_rows     select_col

# get 1st&2nd rows data
df.loc[['r1','r2']]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300

In [38]:
# get all rows but a particular column Courses 
df.loc[:,["Courses"]]

    Courses
r1    Spark
r2  PySpark
r3   Hadoop
r4   Python
r5   pandas

In [39]:
df.loc[:,["Courses","Fee"]]

    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Hadoop  26000
r4   Python  22000
r5   pandas  24000

In [40]:
df.loc["r3":]

   Courses    Fee Duration  Discount
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [44]:
df.loc[df["Fee"]==22000]
# OR
# SQL style
df.query("Fee==22000")
df.query("Courses!='PySpark'")

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200
r4  Python  22000   40days      2500
r5  pandas  24000   60days      2000

In [52]:
df.drop(['Discount'],axis=1)
# 2nd way
#df.drop(columns=['Discount'],['Fee'])

    Courses    Fee Duration
r1    Spark  20000    30day
r2  PySpark  25000   40days
r3   Hadoop  26000   35days
r4   Python  22000   40days
r5   pandas  24000   60days